---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipingPressure
source: html/2ce5b2d3-6136-d859-a297-444f32b6d782.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipingPressure Property

Pressure, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipingPressure { get; }
```